{
"About": {
  "Name": "Isaac J. Fuchs",
  "Currently": "Computer Engineering Student",
  "Headshot": "isaac-portrait.jpeg",
  "Thumbnail": "isaac-portrait.jpeg",
  "AboutText": "Hi, I am Isaac Fuchs. I am a computer engineering student with an interest in software development and programming. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to expanding my knowledge and skills in various areas of computer engineering, with a particular focus on the designing of circuits.<br><br>I enjoy tackling challenging design projects and I work well with others."
},
"Contact": {
  "EMail": "fuchsi@spu.edu",
  "Phone": "(509) 862-9776",
  "Portfolio": "https://isaac-fuchs.github.io/index.html",
  "LinkedIn": "https://www.linkedin.com/in/isaac-fuchs/",
  "GitHub": "https://isaac-fuchs.github.io/index.html"
},
"Experience": {
  "ExperienceText": "I do not have much experience with on job coding, but I know how to both work as a team and act as a leader. <br><br>Both of these qualities are required to reach the rank of Eagle Scout within Scouting, which I did.",
  "School": "Seattle Pacific University",
  "Major": "Computer Engineering",
  "Graduation": "June 2026",
  "EducationText": "I found my passion for programing in my freshman year of high school when I took an AP computer science class. After an internship at an egineering firm in my senior year of high school I did some research and decided on my degree.",
  "Employment": "Sudexo",
  "Role": "Catering",
  "EmploymentText": "I have worked quite a few different jobs. Though none of them directly relate to computer engineering, I belive that my previous work experience has trained me for the basic responcibilities of all jobs.",
  "Skills": ["Java,"  " MIPS," " Circuit Design" " CPR Certified"],
  "SkillsText": "I have coded in Java for 3 years and MIPS assembaly for 3 months. I have been working on cucuits since September 2024. I have been CPR certified for over six years.",
  "Resume": "resume-Isaac-Fuchs.pdf"  
},
"Project1": {
    "Title": "Sallen Key Frquency Filter",
    "Desc": "A sixth order bandpass Sallen Key circuit. Includes a peak detector and comparator to cause a LED to turn on when reciving a signal with a freqeuncy of 25kHz.<br><br>It has a GitHub repo and more details shown in screenshots.",
    "GitHubRepo": "https://github.com",
    "MainImage": "circuit diagram.jpg",
    "DetailImages": ["FRA plot.jpg","oscilliscope responce.jpg"]
  },
  "Project2": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  },
  "Project3": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
